#### На сайте запущен А/В тест с целью увеличить доход. В приложенном excel файле вы найдете сырые данные по результатам эксперимента – user_id, тип выборки variant_name и доход принесенный пользователем revenue. Проанализируйте результаты эксперимента и напишите свои рекомендации менеджеру.

In [28]:
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
df = pd.read_excel('AB_Test_Results (2).xlsx')

C:\Users\leffa\anaconda3\lib\site-packages\openpyxl\worksheet\_read_only.py:79: UserWarning: Unknown extension is not supported and will be removed
  for idx, row in parser.parse():

Убедимся, что файл загружен корректно:

In [6]:
df.head()

   USER_ID VARIANT_NAME  REVENUE
0      737      variant      0.0
1     2423      control      0.0
2     9411      control      0.0
3     7311      control      0.0
4     6174      variant      0.0

Убедимся, что типы данных нас устраивают:

In [8]:
df.dtypes

USER_ID           int64
VARIANT_NAME     object
REVENUE         float64
dtype: object

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   USER_ID       10000 non-null  int64
 1   VARIANT_NAME  10000 non-null  object
 2   REVENUE       10000 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 234.5+ KB

Да, выручка заполнена в формате float64, мы сможем данные анализировать. Объем обеих групп равен 10000 человек, будем надеяться, что распределены они примерно поровну

In [15]:
df.VARIANT_NAME.value_counts()

variant    5016
control    4984
Name: VARIANT_NAME, dtype: int64

Да, почти поровну.

Посмотрим на данные сначала в общем издалека:

In [12]:
df.describe()

            USER_ID       REVENUE
count  10000.000000  10000.000000
mean    4981.080200      0.099447
std     2890.590115      2.318529
min        2.000000      0.000000
25%     2468.750000      0.000000
50%     4962.000000      0.000000
75%     7511.500000      0.000000
max    10000.000000    196.010000

Проверим, нет ли среди участников групп пользователей, которые приняли в эксперименте в обеих группах:

In [23]:
unique = df.groupby('USER_ID', as_index=False).agg({'VARIANT_NAME': pd.Series.nunique})

In [21]:
unique.describe()

            USER_ID  VARIANT_NAME
count   6324.000000   6324.000000
mean    4984.111164      1.243675
std     2893.706011      0.429333
min        2.000000      1.000000
25%     2467.750000      1.000000
50%     4966.500000      1.000000
75%     7508.500000      1.000000
max    10000.000000      2.000000

И их почти 37%. Это очень много, с данными нужно будет работать очень аккуратно.

Проверим, как распределились группы:

In [27]:
unique.VARIANT_NAME.value_counts()

1    4783
2    1541
Name: VARIANT_NAME, dtype: int64

### К сожалению, дальнейшая работа с данными интересна лишь с академической точки зрения, так как правильным решением было бы проведение эксперимента заново.
Корректировать данные можно, но мы снизим мощность и достоверность теста слишком сильно.